{
  "乾隆": "Qianlong (1711–1799), the sixth emperor of the Qing dynasty, was a patron of arts and calligraphy. He practiced various scripts, especially regular script (kaishu) and running script (xingshu), imitating earlier masters. His calligraphy was elegant but often criticized as lacking originality, serving more as an imperial cultural statement than a pursuit of innovation.",
  "仇靖": "Qiu Jing, a Ming dynasty calligrapher, was known for his fine regular and semi-cursive script. He emphasized structure and balance, drawing on the styles of Tang and Song masters, and contributed to the literati tradition of refined, scholarly brushwork.",
  "何绍基": "He Shaoji (1799–1873), a Qing dynasty calligrapher and scholar, excelled in seal script (zhuanshu) and clerical script (lishu), blending ancient stele styles with dynamic brushwork. His work combined strength and elegance, influencing later seal and clerical calligraphers.",
  "佚名": "Anonymous (Yi Ming) refers to works by unknown calligraphers, often found in historical manuscripts, inscriptions, or fragments. Such works are valued for their artistic or historical significance despite lacking an identified author.",
  "傅山": "Fu Shan (1607–1684), a late Ming and early Qing calligrapher, painter, and medical scholar, was renowned for his unconventional and vigorous style. He mastered multiple scripts, integrating ancient stele influences and free expression, reflecting his loyalist spirit against the Qing.",
  "冯子振": "Feng Zizhen, a Yuan dynasty calligrapher and poet, was adept in running and cursive scripts. His calligraphy displayed scholarly refinement and rhythmic flow, embodying literati aesthetics of elegance and poetic sentiment.",
  "刘日升": "Liu Risheng, a Qing dynasty calligrapher, was known for his regular and clerical script works. His brush control and structural precision reflected a dedication to classical models while maintaining personal expressiveness.",
  "吴昌硕": "Wu Changshuo (1844–1927), a leading figure of the late Qing and early Republic era, was a master in seal script and an accomplished painter and seal carver. His calligraphy combined monumental strength with artistic charm, often integrating inscriptions into his paintings.",
  "吴琚": "Wu Ju (1102–1180), a Southern Song calligrapher, excelled in running and cursive scripts. Influenced by Wang Xizhi and other Jin-Tang masters, his works were valued for their elegance, fluidity, and literati grace.",
  "吴让之": "Wu Rangzhi (1799–1870), a Qing dynasty calligrapher and seal carver, was prominent in the revival of seal script. His style was based on ancient bronze and stone inscriptions, merging archaeological precision with artistic vitality.",
  "吴通微": "Wu Tongwei, a Ming dynasty calligrapher, was known for his work in clerical and running scripts, blending structure with expressive brush movements, reflecting literati scholarly ideals.",
  "唐寅": "Tang Yin (1470–1524), also known as Tang Bohu, was a Ming dynasty painter, poet, and calligrapher. His calligraphy reflected elegance and charm, combining the styles of earlier masters with his own refined and poetic sensibility.",
  "墓志": "Epitaph inscriptions (muzhi) are stone or brick-carved texts placed in tombs, recording biographical details and virtues of the deceased. They serve as valuable historical sources and display diverse calligraphic styles from various dynasties.",
  "姚孟起": "Yao Mengqi (1807–1860), a Qing dynasty calligrapher, specialized in clerical script influenced by Han dynasty steles. His brushwork was strong and precise, contributing to the Qing stele studies movement.",
  "姜夔": "Jiang Kui (c. 1155–1221), a Southern Song poet, composer, and calligrapher, was famous for his refined running script. His calligraphy displayed purity and grace, matching the elegance of his poetry and musical compositions.",
  "姜立纲": "Jiang Ligang, a Yuan dynasty calligrapher, was celebrated for his monumental regular and clerical script works, emphasizing stability, clarity, and the influence of Tang models.",
  "孙过庭": "Sun Guoting (646–691), a Tang dynasty calligrapher, is best known for his 'Treatise on Calligraphy' (Shu Pu), an influential theoretical and artistic work written in running script, blending philosophical insight with masterful technique.",
  "宋克": "Song Ke (1327–1387), a Ming dynasty calligrapher, excelled in cursive script and seal script, integrating ancient inscriptions into his creative style with vigorous brush energy.",
  "宋珏": "Song Jue, a Ming dynasty calligrapher, was skilled in regular and running scripts, focusing on balanced structures and literati refinement.",
  "小野道风": "Ono no Michikaze (894–966), a Heian period Japanese calligrapher, is considered one of the 'Three Brush Saints' of Japan. He adapted Chinese calligraphy styles, particularly those of Wang Xizhi, into the distinctive Japanese wayo style.",
  "康熙": "Kangxi (1654–1722), the fourth emperor of the Qing dynasty, was a patron of arts and practiced calligraphy in regular and running scripts. His works imitated classical Tang models, symbolizing imperial authority and cultural refinement.",
  "康里巎巎": "Kangli Naonao (dates unknown), a Yuan dynasty calligrapher of Mongol heritage, was celebrated for his running and cursive scripts, blending vigor with refined structure, influenced by Zhao Mengfu.",
  "张即之": "Zhang Jizhi (1186–1266), a Southern Song calligrapher, excelled in regular and running scripts. His works were upright, powerful, and faithful to Tang models, often compared to Yan Zhenqing.",
  "张弼": "Zhang Bi (1425–1487), a Ming dynasty calligrapher, was known for his wild cursive script, demonstrating unrestrained energy and personal expression, breaking from orthodox conventions.",
  "张旭": "Zhang Xu (c. 675–750), a Tang dynasty master of wild cursive (kuangcao), was famed for his unbridled, vigorous brushwork, earning the nickname 'Crazy Zhang.' His style embodied spontaneity and emotion.",
  "张瑞图": "Zhang Ruitu (1570–1641), a Ming dynasty calligrapher, specialized in cursive and semi-cursive scripts. His work was bold, innovative, and structurally unconventional, making him one of the 'Four Masters of the Ming.'",
  "张芝": "Zhang Zhi (d. 192), an Eastern Han calligrapher, was revered as the 'Sage of Cursive Script.' He developed early cursive forms, influencing later masters like Wang Xizhi.",
  "徐渭": "Xu Wei (1521–1593), a Ming dynasty painter, poet, and calligrapher, was renowned for his expressive cursive script. His works reflected personal emotion and bold experimentation.",
  "怀素": "Huai Su (737–799), a Tang dynasty monk, was a master of wild cursive script. His brushwork was swift, forceful, and full of rhythm, leaving a lasting impact on the art of calligraphy.",
  "摩崖刻石": "Cliff inscriptions (moya kestone) refer to large-scale carvings of calligraphy on rock faces or cliffs, often for commemorative or religious purposes, showcasing monumental styles from various dynasties.",
  "文天祥": "Wen Tianxiang (1236–1283), a Southern Song loyalist, poet, and calligrapher, wrote in regular and running scripts. His works expressed moral integrity and patriotism, often in prison before his execution.",
  "文彭": "Wen Peng (1498–1573), a Ming dynasty calligrapher and seal carver, was a pioneer in literati seal carving, also excelling in running script with elegant brushwork.",
  "文征明": "Wen Zhengming (1470–1559), a leading Ming dynasty scholar-painter and calligrapher, mastered multiple scripts. His calligraphy was refined, balanced, and scholarly, influencing generations of literati.",
  "智永": "Zhiyong (dates uncertain, 6th–7th century), a Sui dynasty monk and descendant of Wang Xizhi, was famed for his 'Thousand Character Classic' in regular script, which became a key model for students.",
  "曾巩": "Zeng Gong (1019–1083), a Northern Song scholar and writer, was also skilled in calligraphy, producing dignified regular script reflecting his literary stature.",
  "朱登": "Zhu Deng, a Ming dynasty calligrapher, was known for his structured and disciplined regular script, following Tang exemplars.",
  "朱耷\\八大山人": "Zhu Da (1626–1705), known as Bada Shanren, was a Ming loyalist monk, painter, and calligrapher. His calligraphy was eccentric and bold, matching the unconventional spirit of his paintings.",
  "李倜": "Li Ti, a Tang dynasty calligrapher, was praised for his elegant running script, merging influence from Wang Xizhi and Tang court styles.",
  "李孝光": "Li Xiaoguang, a Ming dynasty calligrapher, was noted for his regular script, showing a balance of precision and grace.",
  "李斯": "Li Si (c. 280–208 BCE), Prime Minister of the Qin dynasty, standardized the Small Seal Script (xiaozhuan) used in the First Emperor’s inscriptions, shaping the foundation of Chinese written form.",
  "李邕": "Li Yong (678–747), a Tang dynasty calligrapher, excelled in regular and running scripts, producing monumental works with strong structure and elegance.",
  "李阳冰": "Li Yangbing, an 8th-century Tang calligrapher and relative of poet Li Bai, was renowned for his mastery of seal script, influencing later revival movements.",
  "杨凝式": "Yang Ningshi (873–954), a Five Dynasties period calligrapher, was celebrated for his running script marked by elegance and individuality, blending Tang and earlier traditions.",
  "杨沂孙": "Yang Yisun (1813–1897), a Qing dynasty calligrapher, specialized in clerical script, studying Han dynasty steles with precision and vigor.",
  "杨秀": "Yang Xiu (d. 219), an Eastern Han court official, was known for his literary talent and calligraphy in early clerical forms.",
  "杨维桢": "Yang Weizhen (1296–1370), a Yuan dynasty poet and calligrapher, favored dramatic, unconventional styles in large characters, reflecting his bold personality.",
  "柯九思": "Ke Jiusi (1290–1343), a Yuan dynasty scholar-painter and calligrapher, excelled in running script and was a close associate of Zhao Mengfu, blending elegance with scholarly restraint.",
  "柳公权": "Liu Gongquan (778–865), a Tang dynasty calligrapher, was a master of regular script. His style, upright and vigorous, became a standard model alongside Yan Zhenqing.",
  "欧阳询": "Ouyang Xun (557–641), a Tang dynasty calligrapher, produced highly disciplined and elegant regular script, influencing generations of scholars.",
  "欧阳通": "Ouyang Tong, son of Ouyang Xun, continued his father’s style in regular script, contributing to the Tang court's refined calligraphic tradition.",
  "沈尹默": "Shen Yinmo (1883–1971), a modern calligrapher, was noted for his running script influenced by Jin and Tang masters, bridging traditional aesthetics with modern sensibility.",
  "王宠": "Wang Chong (1494–1533), a Ming dynasty calligrapher, excelled in small regular script and running script, valued for precision and grace.",
  "王献之": "Wang Xianzhi (344–386), son of Wang Xizhi, was a master of running and cursive scripts. His 'one-stroke' technique in cursive writing was highly influential.",
  "王珣": "Wang Xun (349–400), a Jin dynasty calligrapher and cousin of Wang Xizhi, was famed for his running script letter 'Letter to Boyuan,' an important surviving work.",
  "王福庵": "Wang Fuan (1880–1960), a modern seal script calligrapher, was known for his meticulous study of ancient inscriptions, producing elegant and precise works.",
  "王羲之": "Wang Xizhi (303–361), the 'Sage of Calligraphy,' was a Jin dynasty master whose running script epitomized fluidity and grace. His 'Preface to the Orchid Pavilion' is revered as a pinnacle of the art.",
  "王诜": "Wang Shen (c. 1036–c. 1093), a Northern Song literati and official, was adept in painting and calligraphy, producing refined running script works.",
  "王铎": "Wang Duo (1592–1652), a Ming–Qing transitional calligrapher, was famous for his cursive script full of energy and grandeur, inspired by Zhang Xu and Huai Su.",
  "皇象": "Huang Xiang, a calligrapher of the Three Kingdoms period (Eastern Wu), was known for his elegant official script and is credited with works like the 'Jiucheng Palace Liquan Inscription.'",
  "祝允明": "Zhu Yunming (1460–1526), a Ming dynasty calligrapher, was a master of cursive script, producing works of great speed, energy, and individuality.",
  "空海": "Kūkai (774–835), a Japanese monk and founder of Shingon Buddhism, studied Chinese calligraphy during the Tang dynasty. He excelled in adapting Tang styles to Japanese aesthetics.",
  "简牍帛书盟书": "Bamboo slips, silk manuscripts, and covenant documents (jiandu, boshu, mengshu) are ancient writing media and forms from pre-Qin to Han periods, providing insight into early script forms such as seal and clerical script.",
  "米芾": "Mi Fu (1051–1107), a Northern Song calligrapher, painter, and connoisseur, was famous for his running and cursive scripts, characterized by elegance, speed, and rhythm.",
  "索靖": "Suo Jing (239–303), a Western Jin calligrapher, excelled in cursive script and was influential in the development of early running and cursive styles.",
  "苏轼": "Su Shi (1037–1101), a Northern Song poet, painter, and calligrapher, was known for his free and expressive running script, reflecting his literary genius.",
  "董其昌": "Dong Qichang (1555–1636), a Ming dynasty painter, theorist, and calligrapher, promoted literati aesthetics and excelled in running and cursive scripts with scholarly refinement.",
  "蔡京": "Cai Jing (1047–1126), a Northern Song chancellor, was skilled in calligraphy, especially running script, though his political career was controversial.",
  "蔡襄": "Cai Xiang (1012–1067), a Northern Song calligrapher and statesman, was one of the 'Four Masters of Song,' known for his dignified regular script.",
  "薛绍彭": "Xue Shaopeng (980–1050), a Northern Song calligrapher, was skilled in regular and running scripts, contributing to the refinement of literati styles.",
  "虞世南": "Yu Shinan (558–638), a Tang dynasty calligrapher, was renowned for his graceful regular script, blending strength with delicacy.",
  "褚遂良": "Chu Suiliang (596–658), a Tang dynasty calligrapher, developed a slender, elegant regular script, serving as a bridge between Ouyang Xun and later Tang styles.",
  "赵之谦": "Zhao Zhiqian (1829–1884), a Qing dynasty calligrapher, painter, and seal carver, combined seal script with running script, influencing modern Chinese art.",
  "赵佶": "Zhao Ji (1082–1135), Emperor Huizong of the Northern Song, created the slender-gold script (shoujin ti), a distinctive, elegant style marked by fine lines and angular turns.",
  "宋徽宗": "Zhao Ji (1082–1135), Emperor Huizong of the Northern Song, created the slender-gold script (shoujin ti), a distinctive, elegant style marked by fine lines and angular turns.",
  "赵孟頫": "Zhao Mengfu (1254–1322), a Yuan dynasty prince and calligrapher, revived Jin-Tang styles with smooth, rounded brushwork in multiple scripts.",
  "赵构": "Zhao Gou (1107–1187), Emperor Gaozong of the Southern Song, was a skilled calligrapher whose works reflected refinement and scholarly taste.",
  "造像记": "Votive inscriptions (zaoxiang ji) are dedicatory texts carved on Buddhist statues or steles, often in clerical or regular script, providing valuable data on religious and artistic history.",
  "邓文原": "Deng Wenyuan (1258–1328), a Yuan dynasty calligrapher, was skilled in regular and running scripts, known for elegant and restrained brushwork.",
  "邓石如": "Deng Shiru (1743–1805), a Qing dynasty master of seal and clerical scripts, studied ancient inscriptions intensively, producing powerful and scholarly works.",
  "金农": "Jin Nong (1687–1764), a Qing dynasty painter and calligrapher, created the 'lacquer script' style, integrating personal creativity with archaic forms.",
  "金文刻石": "Bronze inscriptions (jinwen) are cast or carved texts on ancient Chinese ritual bronzes, primarily from the Shang and Zhou dynasties, serving as crucial sources for early Chinese writing.",
  "钟繇": "Zhong Yao (151–230), a Wei dynasty calligrapher, is regarded as the 'Father of Regular Script,' developing early forms that influenced generations.",
  "钟绍京": "Zhong Shaojing (fl. early 8th century), a Tang dynasty calligrapher, was famous for his monumental regular script inscriptions, such as the 'Huadu Temple Stele.' His style was upright, clear, and became a key model for stone inscription calligraphy.",
  "陆机": "Lu Ji (261–303), a Western Jin dynasty poet, essayist, and calligrapher, was admired for his refined brushwork in running and cursive scripts. His calligraphy paralleled the elegance of his literary works, though few authentic pieces survive.",
  "陆柬之": "Lu Jianzhi (585–638), a Tang dynasty calligrapher, was a relative of Lu Fayan and known for his formal regular script, contributing to the establishment of Tang calligraphic orthodoxy.",
  "陆游": "Lu You (1125–1210), a Southern Song dynasty poet and patriot, was also skilled in running script. His calligraphy was expressive and vigorous, reflecting his passionate literary voice.",
  "陶弘景": "Tao Hongjing (456–536), a scholar, Daoist master, and calligrapher of the Southern Dynasties, excelled in clerical and early regular scripts, blending elegance with scholarly restraint.",
  "颜真卿": "Yan Zhenqing (709–785), a Tang dynasty calligrapher and loyal official, was a master of regular script, creating a robust, upright style that emphasized moral integrity. Works like 'Yan Qinli Stele' remain exemplary.",
  "鲜于枢": "Xianyu Shu (1257–1302), a Yuan dynasty calligrapher, excelled in regular, running, and cursive scripts. His works were vigorous, angular, and influenced by both Jin and Tang traditions.",
  "黄养正": "Huang Yangzheng, a Ming dynasty calligrapher, specialized in running and clerical scripts, producing works of solid structure and scholarly elegance.",
  "黄庭坚": "Huang Tingjian (1045–1105), a Northern Song poet and calligrapher, was a master of running script, developing a distinctive, elongated style influenced by Su Shi and ancient models.",
  "黄自元": "Huang Ziyuan (1837–1917), a Qing dynasty calligrapher, was noted for his clerical script, compiling influential copybooks that became standard references for learners.",
  "黄道周": "Huang Daozhou (1585–1646), a late Ming scholar-official and calligrapher, excelled in regular and running scripts. His style was upright, forceful, and reflected his loyalist ideals.",
  "龚贤": "Gong Xian (1619–1689), a Ming–Qing transitional painter and calligrapher, was skilled in running script. His brushwork paralleled the dense, layered style of his paintings, embodying literati sensibility."
}